paraview_van_dyke/cylinderRe200linearUpvindV/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolver    solidBody;

solidBodyMotionFunction multiMotion;

oscillation
{
    solidBodyMotionFunction oscillatingLinearMotion;
    oscillatingLinearMotionCoeffs
    {
        amplitude     (0 0 0);
        omega         6.28;

        phaseShift    0;
        verticalShift (0 0 0);
    }
}

/*rotation
{
    solidBodyMotionFunction  rotatingMotion;
    rotatingMotionCoeffs
    {
        origin        (0 0.02 0);
        axis          (0 0 1);
        omega         18.8945578;
    }
} */


// ************************************************************************* //

