paraview_van_dyke/cylinderRe200linearUpvindV/system/FOs/FOadd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
add1
{
    type            add;
    libs            ( fieldFunctionObjects );
    fields          ( k k_0 );
    result          kTotal;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         400;
    executeControl  runTime;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   0.5;
}


// ************************************************************************* //
