paraview_van_dyke/cylinderRe200linearUpvindV/system/FOs/FOcuttingPlane
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
surfaces
{
    type            surfaces;
    libs            ( libsampling );
    timeStart       0;
    timeEnd         400;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   0.5;
    surfaceFormat   vtk;
    fields          ( p U vorticity );
    interpolationScheme cellPoint;
    surfaces
    {
        zNormal
        {
            type            cuttingPlane;
            point           ( 0 0 0 );
            normal          ( 0 0 1 );
            interpolate     true;
        }
    }
    startTime       0;
}


// ************************************************************************* //
