paraview_van_dyke/cylinderRe200linearUpvindV/system/FOs/FOfieldStatistics
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

fieldStatistics1
{
    // Mandatory entries
    type            fieldStatistics;
    libs            (fieldFunctionObjects);
    fields          ( U p );
    statistics
    (
        min
        max
        mean
        variance
    );

    // Optional entries
    mode            component;
    mean            arithmetic;
    internal        false;
    extrema         true;

    // Optional (inherited) entries
    writePrecision  10;
    writeToFile     true;
    useUserTime     true;

    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd        500;
    executeControl  runTime;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   0.01;
}
