paraview_van_dyke/cylinderRe200linearUpvindV/system/FOs/FOpow
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pow1
{
    type            pow;
    libs            ( fieldFunctionObjects );
    field           k;
    n               0.25;
    checkDimensions false;
    scale           0.5;
    offset          2.5;
    result          powk;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         400;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   0.5;
}


// ************************************************************************* //
