paraview_van_dyke/cylinderRe200linearUpvindV/system/FOs/FOprobesCylinder
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
probes
{
    type            probes;
    libs            ( libsampling );
    name            probes;
    timeStart       0;
    timeEnd         400;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   0.25;
    fields          ( p U vorticity staticCoeffP );
    probeLocations  ( ( 0.025 0 0 ) ( 0.0246 0.0043 0 ) ( 0.0235 0.0086 0 ) ( 0.0217 0.0125 0 ) ( 0.0192 0.0161 0 ) ( 0.0161 0.0192 0 ) ( 0.0125 0.0217 0 ) ( 0.0086 0.0235 0 ) ( 0.0043 0.0246 0 ) ( 0 0.025 0 ) ( 0.0043 -0.0246 0 ) ( 0.0086 -0.0235 0 ) ( 0.0125 -0.0217 0 ) ( 0.0161 -0.0192 0 ) ( 0.0192 -0.0161 0 ) ( 0.0217 -0.0125 0 ) ( 0.0235 -0.0086 0 ) ( 0.0246 -0.0043 0 ) ( 0.025 0 0 ) ( 0.0246 0.0043 0 ) ( 0.0235 0.0086 0 ) ( 0.0217 0.0125 0 ) ( 0.0192 0.0161 0 ) ( 0.0161 0.0192 0 ) ( 0.0125 0.0217 0 ) ( 0.0086 0.0235 0 ) ( 0.0043 0.0246 0 ) ( 0 0.025 0 ) ( 0.0043 -0.0246 0 ) ( 0.0086 -0.0235 0 ) ( 0.0125 -0.0217 0 ) ( 0.0161 -0.0192 0 ) ( 0.0192 -0.0161 0 ) ( 0.0217 -0.0125 0 ) ( 0.0235 -0.0086 0 ) ( 0.0246 -0.0043 0 ) ( 0 0 0 ) ( 0 0.1 0 ) ( 0 0.15 0 ) ( 0 0.2 0 ) ( 0 0.25 0 ) ( 0 0.3 0 ) ( 0 0.35 0 ) ( 0 0.4 0 ) ( 0 0.45 0 ) ( 0 0.5 0 ) );
    startTime       0;
}


// ************************************************************************* //
