paraview_van_dyke/cylinderRe200linearUpvindV/system/FOs/FOreadFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

readFields1
{
    // Mandatory entries
    type            readFields;
    libs            (fieldFunctionObjects);
    fields          (U p);

    // Optional entries
    readOnStart     true;

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         500;
    executeControl  runTime;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   0.01;
}


// ************************************************************************* //
