paraview_van_dyke/cylinderRe200linearUpvindV/system/FOs/FOsolverInfo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solverInfo1
{
    type            solverInfo;
    libs            ( utilityFunctionObjects );
    fields          ( p U k omega ReThetat gammaInt );
    writeResidualFields false;
    timeStart       0;
    timeEnd         400;
    executeInterval 1;
    writeInterval   0.5;
}


// ************************************************************************* //
