paraview_van_dyke/cylinderRe200linearUpvindV/system/FOs/FOvalueAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
valueAverage1
{
    type            valueAverage;
    libs            ( fieldFunctionObjects );
    functionObject  momentum1;
    fields          ( momentum_x momentum_y momentum_z );
    resetOnRestart  false;
    window          1;
    windowType      exact;
    writePrecision  10;
    writeToFile     true;
    useUserTime     true;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         400;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    adjustableRunTime;
    writeInterval   0.5;
}


// ************************************************************************* //
